Revit 2023 API
RebarConstraint.FlipHandleOverTarget Method
 Flips the RebarConstrainedHandle to the other side of the target bar handle, maintaining the distance in absolute value.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2020.1
Syntax
C#
public void FlipHandleOverTarget()
Visual Basic
Public Sub FlipHandleOverTarget
Visual C++
public:
void FlipHandleOverTarget()
Remarks
 Throw exception if constraint type is not 'ToOtherRebar', or for constraints involving bar/hook bend handle.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.DisabledDisciplineException |  None of the following disciplines is enabled: Structural.
Autodesk.Revit.Exceptions.InvalidOperationException |  RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToOtherRebar.' -or- The RebarTargetConstraintType is 'HookBend' or 'BarBend'.
See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace